<template>
    <div class="question6 each-question">
        <div class="item-cont">
            <div class="item">
                <div class="tit">
                    <p>学校上一届毕业生世界101~200名校录取比例</p>
                </div>
                <ul>
                    <li><input type="number" placeholder="请填写0~100间的有效数字：" v-model="answer[5]" oninput="if(value.length>5)value=value.slice(0,5)"><div class="mark">%</div></li>
                    <li v-show="isError" class="error">×格式有误</li>
                </ul>
            </div>
            
        </div>
        <div class="explain">
            <h4>★ 注 解</h4>
            <i>请参考ARWU最新排名</i>
            <ul>
                <li v-for="(item,index) in schoolInfo" :key="index"><span>{{index+101}}</span>{{ item }}</li>
            </ul>
        </div>
    </div>
</template>
<script>
export default {
    name: 'question6',
    props: ['answer'],
    data(){
        return{
            schoolInfo:[
                '艾克斯-马赛大学',
                '亚利桑那州立大学',
                '贝勒医学院',
                '布朗大学',
                '卡迪夫大学',
                '凯斯西储大学',
                '埃莫里大学',
                '复旦大学',
                '西奈山医学院',
                '印第安纳大学-布鲁明顿',
                '阿卜杜勒阿齐兹国王大学',
                '沙特国王大学',
                '隆德大学',
                '密歇根州立大学',
                '挪威科学技术大学',
                '大阪大学',
                '奈梅亨大学',
                '罗格斯大学新布朗斯维克分校',
                '首尔国立大学',
                '上海交通大学',
                '中山大学',
                '阿德雷德大学',
                '香港大学',
                '新南威尔士大学',
                '谢菲尔德大学',
                '东北大学（仙台）',
                '阿尔伯塔大学',
                '阿姆斯特丹大学',
                '亚利桑那大学',
                '伯尔尼大学',
                '伯明翰大学',
                '波恩大学',
                '加州大学-圣克鲁兹',
                '法兰克福大学',
                '弗莱堡大学',
                '哥德堡大学',
                '洛桑大学',
                '利兹大学',
                '利物浦大学',
                '蒙特利尔大学',
                '诺丁汉大学',
                '中国科学技术大学',
                '南安普敦大学',
                '斯特拉斯堡大学',
                '犹他大学',
                '瓦格宁根大学',
                '华威大学',
                '巴黎第七大学',
                '阿姆斯特丹自由大学',
                '魏茨曼科学研究学院',
                '鲁汶大学（法语）',
                '科庭大学',
                '代尔夫特理工大学',
                '哈尔滨工业大学',
                '北海道大学',
                '华中科技大学',
                '伦敦政治经济学院',
                '伦敦大学卫生和热带医学学院',
                '南京大学',
                '台湾大学',
                '北卡罗来纳州立大学-罗利',
                '俄勒冈卫生科学大学',
                '俄勒冈州立大学',
                '伦敦大学玛丽女王学院',
                '四川大学',
                '成均馆大学',
                '丹麦技术大学',
                '特拉维夫大学',
                '德州农工大学',
                '香港中文大学',
                '卡尔加里大学',
                '格拉斯哥大学',
                '东京工业大学',
                '都柏林三一学院',
                '德累斯顿工业大学',
                '塔夫茨大学',
                '格勒诺布尔大学',
                '布鲁塞尔自由大学（法语）',
                '巴塞罗那大学',
                '加州大学-河滨',
                '科隆大学',
                '埃克塞特大学',
                '汉堡大学',
                '爱荷华大学',
                '莱比锡大学',
                '里斯本大学',
                '马萨诸塞大学-阿默斯特',
                '马萨诸塞大学医学院',
                '米兰大学',
                '明斯特大学',
                '渥太华大学',
                '巴黎第五大学',
                '罗切斯特大学',
                '圣保罗大学',
                '图宾根大学',
                '维也纳大学',
                '弗吉尼亚大学',
                '滑铁卢大学',
                '维尔茨堡大学',
                '西安交通大学'
            ] 
        }
    },
    computed:{
        isError(){
            return (/[^0-9\.]/.test(this.answer[5]) || (Number(this.answer[5]) > 100))
        },
        hasError(){
            return this.isError
        }
    }
}
</script>

